# vsoStateGetRotN

```pascal
FUNCTION vsoStateGetRotN(
				hObj           : HANDLE;
				VAR outDiffAng : VECTOR;
				VAR outIs3D    : BOOLEAN): BOOLEAN;
```

```python
def vs.vsoStateGetRotN(hObj):
    return (BOOLEAN, outDiffAng, outIs3D)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE|   |
|outDiffAng|VECTOR|   |
|outIs3D|BOOLEAN|   |

## Version
Availability: from Vectorworks 2020

## Category
* Object Events